{
  "users": [
    {
      "firstName": "Sam",
      "lastName": "Smith",
      "emailAddress": "joe@smith.com",
      "password": "joepassword"
    },
    {
      "firstName": "Sally",
      "lastName": "Alexes",
      "emailAddress": "sally@jones.com",
      "password": "sallypassword"
    },
    {
      "firstName": "Michael",
      "lastName": "C",
      "emailAddress": "xyeres@me.com",
      "password": "xyeres@41244332423"
    }
    
  ],
  "courses": [
    {
      "userId": 1,
      "title": "Build a Basic Bookcase",
      "description": "High-end furniture projects are great to dream about. But unless you have a well-equipped shop and some serious woodworking experience to draw on, it can be difficult to turn the dream into a reality.\n\nNot every piece of furniture needs to be a museum showpiece, though. Often a simple design does the job just as well and the experience gained in completing it goes a long way toward making the next project even better.\n\nOur pine bookcase, for example, features simple construction and it's designed to be built with basic woodworking tools. Yet, the finished project is a worthy and useful addition to any room of the house. While it's meant to rest on the floor, you can convert the bookcase to a wall-mounted storage unit by leaving off the baseboard. You can secure the cabinet to the wall by screwing through the cabinet cleats into the wall studs.\n\nWe made the case out of materials available at most building-supply dealers and lumberyards, including 1/2 x 3/4-in. parting strip, 1 x 2, 1 x 4 and 1 x 10 common pine and 1/4-in.-thick lauan plywood. Assembly is quick and easy with glue and nails, and when you're done with construction you have the option of a painted or clear finish.\n\nAs for basic tools, you'll need a portable circular saw, hammer, block plane, combination square, tape measure, metal rule, two clamps, nail set and putty knife. Other supplies include glue, nails, sandpaper, wood filler and varnish or paint and shellac.\n\nThe specifications that follow will produce a bookcase with overall dimensions of 10 3/4 in. deep x 34 in. wide x 48 in. tall. While the depth of the case is directly tied to the 1 x 10 stock, you can vary the height, width and shelf spacing to suit your needs. Keep in mind, though, that extending the width of the cabinet may require the addition of central shelf supports.",
      "estimatedTime": "12 hours",
      "materialsNeeded": "* 1/2 x 3/4 inch parting strip\n* 1 x 2 common pine\n* 1 x 4 common pine\n* 1 x 10 common pine\n* 1/4 inch thick lauan plywood\n* Finishing Nails\n* Sandpaper\n* Wood Glue\n* Wood Filler\n* Minwax Oil Based Polyurethane\n"
    },
    {
      "userId": 2,
      "title": "Learn How to Program",
      "description": "In this course, you'll learn how to write code like a pro!",
      "estimatedTime": "6 hours",
      "materialsNeeded": "* Notebook computer running Mac OS X or Windows\n* Text editor"
    },
    {
      "userId": 3,
      "title": "How to Mow the Lawn",
      "description": "Many homeowners see mowing the lawn as an unwelcome chore, while others view it as an opportunity to beautify their property. When done properly, mowing supports green, healthy grass, and reduces weeds and bare spots. With a bit of practice, you can even mow eye-pleasing patterns into your lawn!",
       "estimatedTime": "30 mins",
      "materialsNeeded": "* Lawnmower \n* Sunshine"
    },
    {
      "userId": 3,
      "title": "How to Get an A Without Reading the Book",
      "description": "It happens. You had so many other assignments for so many other classes that you just didn't have time to cram everything in. This article will help you manage to swing an A without reading the book. Note: this focuses chiefly on literature, but the method can be applied to any book or class with some slight tweaking.",
       "estimatedTime": "15 mins",
      "materialsNeeded": "* If there is a movie adaptation of the book, watch it. \n* If the book has a Wikipedia page, read it. \n* Go to the Sparknotes and/or CliffsNotes websites. \n* If your book is not on these websites, do a Google search on the book title."
    },
    {
      "userId": 3,
      "title": "How to Walk",
      "description": "Walking is one of the best low-impact exercises, and it's also one of the cheapest and most convenient ways to get healthier; however, many Americans walk less than half of the daily recommended steps. Walking can reduce your risk of heart disease and cancer, while reducing chronic pain and stress.",
       "estimatedTime": "5 mins",
      "materialsNeeded": "* Walkin' Shoes \n* Legs"
    },
    {
      "userId": 3,
      "title": "How to Finish Reading a Book",
      "description": "Most people have had the irksome but very real experience of starting to read a very good book, getting sidetracked or distracted, and laying it down for a little too long to find the enthusiasm to get back into it. Losing your place or eventually losing enthusiasm about reading the book is a common experience, but it's something that you can overcome. This article will show you how you can combat the waning enthusiasm to get back into reading a book and to finally get through it, right to that last chapter.",
      "estimatedTime": "2 hours",
      "materialsNeeded": "* A library \n* A train carriage \n* A coffee shop \n* A toilet  \n* A park"
    },
    {
      "userId": 3,
      "title": "How to Cook in a Microwave",
      "description": "Microwave ovens are convenient because they cook food much quicker than other methods, and they can be used to defrost frozen food. Making delicious and nutritious meals in the microwave isn't quite as simple as it seems, and getting the best results from your food means following a few rules. The big things to remember with microwave cooking are keeping in moisture, and ensuring even cooking time.",
      "estimatedTime": "5 mins",
      "materialsNeeded": "* Separate foods by cooking time \n* Cut up large food to speed up cooking time \n* Pierce foods that have a skin \n* Arrange the food properly on a microwave-safe dish  \n* Cover your food before cooking it"
    }
  ]
}